In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.DataFrame({
    'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar'],
    'B' : ['one', 'one', 'two', 'three','two', 'two'],
    'C' : [1, 5, 5, 2, 5, 5],
    'D' : [2.0, 5., 8., 1., 2., 9.]
})

In [3]:
df

     A      B  C    D
0  foo    one  1  2.0
1  bar    one  5  5.0
2  foo    two  5  8.0
3  bar  three  2  1.0
4  foo    two  5  2.0
5  bar    two  5  9.0

In [5]:
df.groupby('A')[['C', 'D']].transform(lambda x: (x - x.mean()) / x.std())

          C         D
0 -1.154701 -0.577350
1  0.577350  0.000000
2  0.577350  1.154701
3 -1.154701 -1.000000
4  0.577350 -0.577350
5  0.577350  1.000000

In [4]:
df.groupby('A').agg({'C':['mean'],'D':['median']})

            C      D
         mean median
A
bar  4.000000    5.0
foo  3.666667    2.0